app/controllers/companies_controller.rb

SELECT * FROM `companies` ORDER BY title
---
  def index
    @companies = Company.all

SELECT * FROM `companies` WHERE (`companies`.`id` = 1)
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM `companies` WHERE (`companies`.`id` = 2)
---
  def edit
    @company = Company.find(params[:id])

INSERT INTO `companies` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-09-19 18:39:34', 'IBM', '2009-09-19 18:39:34', '')
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save