app/controllers/contents_controller.rb

UPDATE `contents` SET `updated_at` = '2009-09-19 06:43:59', `latest_offer` = '<table width=\"100%\" border=\"0\" cellspacing=\"0\" cellpadding=\"0\">\r\n\r\n <tr>\r\n\r\n <td align=\"right\" valign=\"top\"><table width=\"100%\" border=\"0\" cellspacing=\"0\" cellpadding=\"0\">\r\n\r\n <tr>\r\n\r\n <td align=\"right\" valign=\"top\" style=\"padding-top:46px; padding-right:45px;\" class=\"black30tahoma\">Welcome to <span style=\"color:#ff5a0f;\">variantsystem.com</span></td>\r\n\r\n </tr>\r\n\r\n <tr>\r\n\r\n <td align=\"left\" valign=\"top\" style=\"padding-left:311px; padding-top:31px;\" class=\"black16tahoma\">\r\n <span style=\"color:#00000; font-size:22px; font-weight:normal;\">Computer Sales & Service</span><br />\r\n\r\n <span style=\"color:#ffffff; font-size:18px; font-weight:normal;\">Makardah, Howrah</span><br />\r\n <span style=\"color:#f24501; font-size:18px; font-weight:normal;\">9831280829, 9804607768</span><br />\r\n\r\n <span style=\"color:#030303; font-size:15px;\">Pujo Special DHAMAKA</span><br />\r\n\r\n <span style=\"color:#f24501; font-size:20px; font-weight:normal;\">Amazing Offer Price</span><br />\r\n\r\n On Selected 3 Models...</td>\r\n\r\n </tr>\r\n\r\n <tr>\r\n\r\n <td align=\"right\" valign=\"top\" style=\"padding:30px 18px 0 0px;\"><a href=\"#\" class=\"link_order\">Order Now!</a></td>\r\n\r\n </tr>\r\n\r\n </table>' WHERE `id` = 1
---
  def update
    respond_to do |format|
      if @content.update_attributes(params[:content])

SELECT * FROM `contents` LIMIT 1
---
  def find_content
    @content = Content.first