app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items` ORDER BY title

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def create
    @item = Item.new(params[:item])
    if @item.save
---
INSERT INTO `items` (`price`, `created_at`, `title`, `product_id`, `updated_at`, `tag`, `company_id`, `description`) VALUES(10, '2009-09-20 03:51:31', 'Home PC', 8, '2009-09-20 03:51:31', 'New', NULL, '')

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def update
    @item = Item.find(params[:id])
    if @item.update_attributes(params[:item])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)
UPDATE `items` SET `updated_at` = '2009-09-20 05:51:51', `description` = 'Dell Mini 10\r\nDell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10Dell Mini 10' WHERE `id` = 12