app/controllers/products_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.all

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-09-19 20:15:40', 'RAM', '2009-09-19 20:15:40', '')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2009-09-20 04:51:46', `avatar_file_size` = 2100, `avatar_file_name` = 'pro3.jpg', `avatar_updated_at` = '2009-09-20 04:51:46', `avatar_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])