app/controllers/stores_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 11)