app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `username`, `password_salt`, `password_hash`, `email`) VALUES('2009-09-18 18:54:26', '2009-09-18 18:54:26', 'rajib', 'b2c21fde37d95f6918e89b2014882fc3138d2c9c', '78905ac00cc62e7c84fc405b3902adc29cc25897', 'rchowdhury@example.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save